In [ ]:
# 넘파이의 어레이에서는 요소 간 데이터 유형이 같아야만 한다.
# 판다스는 어디레에서의 요소 간 데이터 유형이 다를 수 있다.
# Series는 열이 하나
# DataFrame은 열이 두 개 이상

In [1]:
import pandas as pd
member=pd.Series(['홍길동','전우치','강감찬','스티브잡스'])
member

0      홍길동
1      전우치
2      강감찬
3    스티브잡스
dtype: object

In [4]:
import pandas as pd
member=pd.Series(['홍길동','전우치','강감찬','잡스'],index=['1번','2번','3번','4번'])
member

1번    홍길동
2번    전우치
3번    강감찬
4번     잡스
dtype: object

In [9]:
sal1={'삼성':100,'엘지':200,'현대':399}
sal2=pd.Series(sal1)
print(sal2)

sal2['삼성']

삼성    100
엘지    200
현대    399
dtype: int64

100

In [12]:
import pandas as pd
member3={'이름':['최대승','냥순','깜순'],'나이':[24,7,7],'전투력':[100,200,300]}
member4=pd.DataFrame(member3)
member4

    이름  나이  전투력
0  최대승  24  100
1   냥순   7  200
2   깜순   7  300

In [67]:
# 가장 많이 쓰는 방법 ********************************

import pandas as pd
name=['멋진대승','냥순','깜순']
birth=[24,7,7]
power=[100,200,300]

member5=pd.DataFrame()
member5['이름']=name
member5['나이']=birth
member5['전투력']=power

member5

     이름  나이  전투력
0  멋진대승  24  100
1    냥순   7  200
2    깜순   7  300

In [19]:
member5.sort_values('전투력',ascending=False)

     이름  나이  전투력
2    깜순   7  300
1    냥순   7  200
0  멋진대승  24  100

In [30]:
import pandas as pd

data1 = pd.read_excel('C:/temp/부품구입대장2.xls')
print(data1)

         신청날짜 사업장          품목  수량       단가        금액
0  2019-08-23  석수       ANGLE  21    32000    672000
1  2019-09-09  석수          백관  44    56000   2464000
2  2019-06-18  석수         절연판  40    45000   1800000
3  2019-03-13  석수  P/Z O-RING  11    38000    418000
4  2019-05-11  석수         알코올  38     8000    304000
5  2019-06-28  석수         실리콘  30   150000   4500000
6  2019-02-16  석수         소모품   4     2200      8800
7  2019-10-22  석수       MOTOR  14    30000    420000
8  2019-03-18  석수  PAPER BRSH  13    40000    520000
9  2019-07-17  석수        불화카리  23    83000   1909000
10 2019-07-23  석수         마크펜  33     3000     99000
11 2019-03-20  석수         NUT  20    15000    300000
12 2019-01-27  석수         윤활유  30  2000000  60000000
13 2019-07-11  석수         소모품  50     2200    110000
14 2019-05-16  석수        BITE  14    86000   1204000

In [33]:
import pandas as pd

data2 = pd.read_csv('C:/temp/사원별판매현황_홍길동.csv',encoding='cp949')
print(data2)

    이름   요일   실적
0  홍길동  월요일  100
1  홍길동  화요일   70
2  홍길동  수요일   80
3  홍길동  목요일   85
4  홍길동  금요일   65
5  홍길동  토요일   95
6  홍길동  일요일  120

In [57]:
member5

     이름  나이  전투력
0  멋진대승  24  100
1    냥순   7  200
2    깜순   7  300

In [35]:
member5['나이']

0    24
1     7
2     7
Name: 나이, dtype: int64

In [68]:
member5.loc[1]

이름      냥순
나이       7
전투력    200
Name: 1, dtype: object

In [69]:
member9=member5.loc[member5['전투력']>150]
member9

   이름  나이  전투력
1  냥순   7  200
2  깜순   7  300

In [70]:
# 교집합은 ()&() 꼴이다.
# OR는 () | () 꼴이다.

member5.loc[(member5['전투력']<150) & (member5['나이']>10)]

     이름  나이  전투력
0  멋진대승  24  100

In [52]:
member6=pd.DataFrame(member5.columns=['이름','나이','전투력','민첩성'])
member6

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (2693326411.py, line 2)

In [71]:
member5.loc[2]=['정회령',24,3]
member5

     이름  나이  전투력
0  멋진대승  24  100
1    냥순   7  200
2   정회령  24    3

In [82]:
# drop함수로 열을 삭제하기

member8=member5.drop(columns='나이')
member8

     이름  전투력
0  멋진대승  100
1    냥순  200
2   정회령    3

In [84]:
# drop함수로 행을 삭제하기

member11=member5.drop([0])
member11

    이름  나이  전투력
1   냥순   7  200
2  정회령  24    3

In [72]:
# drop함수로 행을 삭제하기
# .index가 포인트

member10=member5.drop(   member5   [member5.나이<24].index   )    #해당 조건에 맞는 인덱스
member10

     이름  나이  전투력
0  멋진대승  24  100
2   정회령  24    3

In [77]:
# 데이터프레임 합치기 (1~4)                                                                                                                                                                                                                                                                                                                          

#1. 이너 조인: 교집합 추출
pd.merge(member5,member10, left_on='이름',right_on='이름')

     이름  나이_x  전투력_x  나이_y  전투력_y
0  멋진대승    24    100    24    100
1   정회령    24      3    24      3

In [78]:
#2. left 조인: 왼쪽 꺼는 다 뽑고, 오른쪽 꺼는 거기다가 갖다붙이기
pd.merge(member5,member10, how='left',left_on='이름',right_on='이름')

     이름  나이_x  전투력_x  나이_y  전투력_y
0  멋진대승    24    100  24.0  100.0
1    냥순     7    200   NaN    NaN
2   정회령    24      3  24.0    3.0

In [79]:
#3. right 조인: 오른쪽 꺼는 다 뽑고, 왼쪽 꺼는 거기다가 갖다붙이기
pd.merge(member5,member10, how='right',left_on='이름',right_on='이름')

     이름  나이_x  전투력_x  나이_y  전투력_y
0  멋진대승    24    100    24    100
1   정회령    24      3    24      3

In [80]:
#4. 아우터 조인: 오른쪽, 왼쪽 꺼는 다 뽑기
pd.merge(member5,member10, how='outer',left_on='이름',right_on='이름')

     이름  나이_x  전투력_x  나이_y  전투력_y
0  멋진대승    24    100  24.0  100.0
1    냥순     7    200   NaN    NaN
2   정회령    24      3  24.0    3.0

In [86]:
#컨텍트로 데이터프레임 합치기

pd.concat([member5,member10],axis=0)

     이름  나이  전투력
0  멋진대승  24  100
1    냥순   7  200
2   정회령  24    3
0  멋진대승  24  100
2   정회령  24    3

In [87]:
pd.concat([member5,member10],axis=1)

     이름  나이  전투력    이름    나이    전투력
0  멋진대승  24  100  멋진대승  24.0  100.0
1    냥순   7  200   NaN   NaN    NaN
2   정회령  24    3   정회령  24.0    3.0